{
  "url": "https://api.github.com/repos/ethereum/go-ethereum/issues/16538",
  "repository_url": "https://api.github.com/repos/ethereum/go-ethereum",
  "labels_url": "https://api.github.com/repos/ethereum/go-ethereum/issues/16538/labels{/name}",
  "comments_url": "https://api.github.com/repos/ethereum/go-ethereum/issues/16538/comments",
  "events_url": "https://api.github.com/repos/ethereum/go-ethereum/issues/16538/events",
  "html_url": "https://github.com/ethereum/go-ethereum/issues/16538",
  "id": 316184529,
  "node_id": "MDU6SXNzdWUzMTYxODQ1Mjk=",
  "number": 16538,
  "title": "i cannot sync full data",
  "user": {
    "login": "bingge1",
    "id": 5134181,
    "node_id": "MDQ6VXNlcjUxMzQxODE=",
    "avatar_url": "https://avatars.githubusercontent.com/u/5134181?v=4",
    "gravatar_id": "",
    "url": "https://api.github.com/users/bingge1",
    "html_url": "https://github.com/bingge1",
    "followers_url": "https://api.github.com/users/bingge1/followers",
    "following_url": "https://api.github.com/users/bingge1/following{/other_user}",
    "gists_url": "https://api.github.com/users/bingge1/gists{/gist_id}",
    "starred_url": "https://api.github.com/users/bingge1/starred{/owner}{/repo}",
    "subscriptions_url": "https://api.github.com/users/bingge1/subscriptions",
    "organizations_url": "https://api.github.com/users/bingge1/orgs",
    "repos_url": "https://api.github.com/users/bingge1/repos",
    "events_url": "https://api.github.com/users/bingge1/events{/privacy}",
    "received_events_url": "https://api.github.com/users/bingge1/received_events",
    "type": "User",
    "site_admin": false
  },
  "labels": [

  ],
  "state": "closed",
  "locked": false,
  "assignee": null,
  "assignees": [

  ],
  "milestone": null,
  "comments": 1,
  "created_at": "2018-04-20T08:57:45Z",
  "updated_at": "2018-04-20T09:02:09Z",
  "closed_at": "2018-04-20T09:02:09Z",
  "author_association": "NONE",
  "active_lock_reason": null,
  "body": "eth.syncing \r\nshow: \r\n{\r\n  currentBlock: 5473192,\r\n  highestBlock: 5473276,\r\n  knownStates: 19617876,\r\n  pulledStates: 19611848,\r\n  startingBlock: 5473007\r\n}\r\nshow dir size\r\n72G\t./eth1\r\n72G\t.\r\n\r\ni cannot sync full data ,",
  "closed_by": {
    "login": "karalabe",
    "id": 129561,
    "node_id": "MDQ6VXNlcjEyOTU2MQ==",
    "avatar_url": "https://avatars.githubusercontent.com/u/129561?v=4",
    "gravatar_id": "",
    "url": "https://api.github.com/users/karalabe",
    "html_url": "https://github.com/karalabe",
    "followers_url": "https://api.github.com/users/karalabe/followers",
    "following_url": "https://api.github.com/users/karalabe/following{/other_user}",
    "gists_url": "https://api.github.com/users/karalabe/gists{/gist_id}",
    "starred_url": "https://api.github.com/users/karalabe/starred{/owner}{/repo}",
    "subscriptions_url": "https://api.github.com/users/karalabe/subscriptions",
    "organizations_url": "https://api.github.com/users/karalabe/orgs",
    "repos_url": "https://api.github.com/users/karalabe/repos",
    "events_url": "https://api.github.com/users/karalabe/events{/privacy}",
    "received_events_url": "https://api.github.com/users/karalabe/received_events",
    "type": "User",
    "site_admin": false
  },
  "reactions": {
    "url": "https://api.github.com/repos/ethereum/go-ethereum/issues/16538/reactions",
    "total_count": 0,
    "+1": 0,
    "-1": 0,
    "laugh": 0,
    "hooray": 0,
    "confused": 0,
    "heart": 0,
    "rocket": 0,
    "eyes": 0
  },
  "timeline_url": "https://api.github.com/repos/ethereum/go-ethereum/issues/16538/timeline",
  "performed_via_github_app": null,
  "state_reason": "completed"
}
[
  {
    "url": "https://api.github.com/repos/ethereum/go-ethereum/issues/comments/383033656",
    "html_url": "https://github.com/ethereum/go-ethereum/issues/16538#issuecomment-383033656",
    "issue_url": "https://api.github.com/repos/ethereum/go-ethereum/issues/16538",
    "id": 383033656,
    "node_id": "MDEyOklzc3VlQ29tbWVudDM4MzAzMzY1Ng==",
    "user": {
      "login": "karalabe",
      "id": 129561,
      "node_id": "MDQ6VXNlcjEyOTU2MQ==",
      "avatar_url": "https://avatars.githubusercontent.com/u/129561?v=4",
      "gravatar_id": "",
      "url": "https://api.github.com/users/karalabe",
      "html_url": "https://github.com/karalabe",
      "followers_url": "https://api.github.com/users/karalabe/followers",
      "following_url": "https://api.github.com/users/karalabe/following{/other_user}",
      "gists_url": "https://api.github.com/users/karalabe/gists{/gist_id}",
      "starred_url": "https://api.github.com/users/karalabe/starred{/owner}{/repo}",
      "subscriptions_url": "https://api.github.com/users/karalabe/subscriptions",
      "organizations_url": "https://api.github.com/users/karalabe/orgs",
      "repos_url": "https://api.github.com/users/karalabe/repos",
      "events_url": "https://api.github.com/users/karalabe/events{/privacy}",
      "received_events_url": "https://api.github.com/users/karalabe/received_events",
      "type": "User",
      "site_admin": false
    },
    "created_at": "2018-04-20T09:01:46Z",
    "updated_at": "2018-04-20T09:01:46Z",
    "author_association": "MEMBER",
    "body": "Syncing Ethereum is a pain point for many people, so I'll try to detail what's happening behind the scenes so there might be a bit less confusion.\r\n\r\nThe current default mode of sync for Geth is called fast sync. Instead of starting from the genesis block and reprocessing all the transactions that ever occurred (which could take weeks), fast sync downloads the blocks, and only verifies the associated proof-of-works. Downloading all the blocks is a straightforward and fast procedure and will relatively quickly reassemble the entire chain.\r\n\r\nMany people falsely assume that because they have the blocks, they are in sync. Unfortunately this is not the case, since no transaction was executed, so we do not have any account state available (ie. balances, nonces, smart contract code and data). These need to be downloaded separately and cross checked with the latest blocks. This phase is called the state trie download and it actually runs concurrently with the block downloads; alas it take a lot longer nowadays than downloading the blocks.\r\n\r\nSo, what's the state trie? In the Ethereum mainnet, there are a [ton of accounts already](https://etherscan.io/chart/address), which track the balance, nonce, etc of each user/contract. The accounts themselves are however insufficient to run a node, they need to be cryptographically linked to each block so that nodes can actually verify that the account's are not tampered with. This cryptographic linking is done by creating a tree data structure above the accounts, each level aggregating the layer below it into an ever smaller layer, until you reach the single root. This gigantic data structure containing all the accounts and the intermediate cryptographic proofs is called the state trie.\r\n\r\nOk, so why does this pose a problem? This trie data structure is an intricate interlink of hundreds of millions of tiny cryptographic proofs (trie nodes). To truly have a synchronized node, you need to download all the account data, as well as all the tiny cryptographic proofs to verify that noone in the network is trying to cheat you. This itself is already a crazy number of data items. The part where it gets even messier is that this data is constantly morphing: at every block (15s), about 1000 nodes are deleted from this trie and about 2000 new ones are added. This means your node needs to synchronize a dataset that is changing 200 times per second. The worst part is that while you are synchronizing, the network is moving forward, and state that you begun to download might disappear while you're downloading, so your node needs to constantly follow the network while trying to gather all the recent data. But until you actually do gather all the data, your local node is not usable since it cannot cryptographically prove anything about any accounts.\r\n\r\nIf you see that you are 64 blocks behind mainnet, you aren't yet synchronized, not even close. You are just done with the block download phase and still running the state downloads. You can see this yourself via the seemingly endless `Imported state entries [...]` stream of logs. You'll need to wait that out too before your node comes truly online.\r\n\r\n---\r\n\r\n**Q: The node just hangs on importing state enties?!**\r\n\r\nA: The node doesn't hang, it just doesn't know how large the state trie is in advance so it keeps on going and going and going until it discovers and downloads the entire thing.\r\n\r\nThe reason is that a block in Ethereum only contains the state root, a single hash of the root node. When the node begins synchronizing, it knows about exactly 1 node and tries to download it. That node, can refer up to 16 new nodes, so in the next step, we'll know about 16 new nodes and try to download those. As we go along the download, most of the nodes will reference new ones that we didn't know about until then. This is why you might be tempted to think it's stuck on the same numbers. It is not, rather it's discovering and downloading the trie as it goes along.\r\n\r\n**Q: I'm stuck at 64 blocks behind mainnet?!**\r\n\r\nA: As explained above, you are not stuck, just finished with the block download phase, waiting for the state download phase to complete too. This latter phase nowadays take a lot longer than just getting the blocks.\r\n\r\n**Q: Why does downloading the state take so long, I have good bandwidth?**\r\n\r\nA: State sync is mostly limited by disk IO, not bandwidth.\r\n\r\nThe state trie in Ethereum contains hundreds of millions of nodes, most of which take the form of a single hash referencing up to 16 other hashes. This is a horrible way to store data on a disk, because there's almost no structure in it, just random numbers referencing even more random numbers. This makes any underlying database weep, as it cannot optimize storing and looking up the data in any meaningful way.\r\n\r\nNot only is storing the data very suboptimal, but due to the 200 modification / second and pruning of past data, we cannot even download it is a properly pre-processed way to make it import faster without the underlying database shuffling it around too much. The end result is that even a fast sync nowadays incurs a huge disk IO cost, which is too much for a mechanical hard drive.\r\n\r\n**Q: Wait, so I can't run a full node on an HDD?**\r\n\r\nA: Unfortunately not. Doing a fast sync on an HDD will take more time than you're willing to wait with the current data schema. Even if you do wait it out, an HDD will not be able to keep up with the read/write requirements of transaction processing on mainnet.\r\n\r\nYou however should be able to run a light client on an HDD with minimal impact on system resources. If you wish to run a full node however, an SSD is your only option.",
    "reactions": {
      "url": "https://api.github.com/repos/ethereum/go-ethereum/issues/comments/383033656/reactions",
      "total_count": 0,
      "+1": 0,
      "-1": 0,
      "laugh": 0,
      "hooray": 0,
      "confused": 0,
      "heart": 0,
      "rocket": 0,
      "eyes": 0
    },
    "performed_via_github_app": null
  }
]
