{
  "url": "https://api.github.com/repos/ethereum/solidity/issues/12351",
  "repository_url": "https://api.github.com/repos/ethereum/solidity",
  "labels_url": "https://api.github.com/repos/ethereum/solidity/issues/12351/labels{/name}",
  "comments_url": "https://api.github.com/repos/ethereum/solidity/issues/12351/comments",
  "events_url": "https://api.github.com/repos/ethereum/solidity/issues/12351/events",
  "html_url": "https://github.com/ethereum/solidity/issues/12351",
  "id": 1067517555,
  "node_id": "I_kwDOAm_5kc4_oQZz",
  "number": 12351,
  "title": "Lifetime tracking for temporary memory objects",
  "user": {
    "login": "cameel",
    "id": 137030,
    "node_id": "MDQ6VXNlcjEzNzAzMA==",
    "avatar_url": "https://avatars.githubusercontent.com/u/137030?v=4",
    "gravatar_id": "",
    "url": "https://api.github.com/users/cameel",
    "html_url": "https://github.com/cameel",
    "followers_url": "https://api.github.com/users/cameel/followers",
    "following_url": "https://api.github.com/users/cameel/following{/other_user}",
    "gists_url": "https://api.github.com/users/cameel/gists{/gist_id}",
    "starred_url": "https://api.github.com/users/cameel/starred{/owner}{/repo}",
    "subscriptions_url": "https://api.github.com/users/cameel/subscriptions",
    "organizations_url": "https://api.github.com/users/cameel/orgs",
    "repos_url": "https://api.github.com/users/cameel/repos",
    "events_url": "https://api.github.com/users/cameel/events{/privacy}",
    "received_events_url": "https://api.github.com/users/cameel/received_events",
    "type": "User",
    "site_admin": false
  },
  "labels": [
    {
      "id": 1282209978,
      "node_id": "MDU6TGFiZWwxMjgyMjA5OTc4",
      "url": "https://api.github.com/repos/ethereum/solidity/labels/optimizer",
      "name": "optimizer",
      "color": "d4c5f9",
      "default": false,
      "description": ""
    },
    {
      "id": 4437999539,
      "node_id": "LA_kwDOAm_5kc8AAAABCIZ_sw",
      "url": "https://api.github.com/repos/ethereum/solidity/labels/high%20effort",
      "name": "high effort",
      "color": "ff54f4",
      "default": false,
      "description": "A lot to implement but still doable by a single person. The task is large or difficult."
    },
    {
      "id": 4438153180,
      "node_id": "LA_kwDOAm_5kc8AAAABCIjX3A",
      "url": "https://api.github.com/repos/ethereum/solidity/labels/high%20impact",
      "name": "high impact",
      "color": "001dff",
      "default": false,
      "description": "Changes are very prominent and affect users or the project in a major way."
    }
  ],
  "state": "open",
  "locked": false,
  "assignee": null,
  "assignees": [

  ],
  "milestone": null,
  "comments": 2,
  "created_at": "2021-11-30T17:52:45Z",
  "updated_at": "2022-09-14T16:09:02Z",
  "closed_at": null,
  "author_association": "MEMBER",
  "active_lock_reason": null,
  "body": "## Abstract\r\nThis issue proposes a mechanism for avoiding permanent memory allocation of memory objects that are immediately consumed and not used afterwards. The mechanism works at compilation time by generating code that writes to designated areas in unallocated memory space in a controlled manner, without the need to actually move the free memory pointer at runtime.\r\n\r\n## Motivation\r\nThere are many cases where the allocated memory is either never used (#12306) or could be freed immediately after use (#12335, #4182, #9046). Attempts to deal with them at Yul level (#5107) were unsuccessful so far because at that level we lose some semantic information about variables. Doing it in the code generator at the Solidity level is actually simpler.\r\n\r\n This will make memory use less wasteful in many simple cases, e.g. the common `keccak256(abi.encode(...))` pattern.\r\n\r\n## Specification\r\nTo be able to perform this optimization we need to classify certain elements of the AST:\r\n- `memory` parameters of all callables (functions, modifiers, events, errors, constructors, etc.) and inputs of all types of expressions and statements are classified as either *consuming* or *capturing*. A memory object is captured if a reference to it remains stored a variable that survives the call. Otherwise we consider it consumed.\r\n- `memory` return values in all expressions present in the source are classified as either *temporary* or *permanent*. The result is temporary if no other reference to the same memory object exists.\r\n\r\nWhen a temporary object is passed into a consuming argument (which can be determined at compilation time), it is safe to destroy it immediately after the expression is evaluated.\r\n\r\nIf a permanent allocation of another memory object is necessary before the deallocation of a temporary, the optimization cannot be performed and the temporary is reclassified as permanent (*forced permanent*).\r\n\r\n### *consuming* and *capturing* arguments\r\n- Parameters of user-defined functions and modifiers are always **capturing**.\r\n    - We might be able to relax this rule later with extra analysis.\r\n- Parameters of struct constructors and items in array literals are always **capturing**.\r\n- Parameters of events and errors are always **consuming**.\r\n- Parameters of builtins can be **capturing or consuming** - information about this must be hard-coded in the compiler.\r\n- Parameters of built-in operators and statements can be **capturing or consuming**:\r\n    - Right-hand-side of an assignment operator that assigns a reference is **capturing**.\r\n    - Right-hand-side of an assignment operator that copies the whole object **consuming**.\r\n    - `delete` operator is **consuming**.\r\n    - Any operators and builtins that short-circuit their arguments (ternary operator, `&&`, `||`, `require()`) are **capturing**.\r\n        - This is a limitation that could be lifted at the cost of more complex code generation - see below.\r\n    - Any arithmetic or comparison operator that takes or could potentially take memory objects as arguments is **consuming**. E.g. `==`.\r\n    - Parameters of all other built-in statements and operators are **capturing**.\r\n\r\n### *temporary* and *permanent* returns\r\n- Return values of expressions that directly allocate memory are **temporary**. This includes operator `new`, struct constructors, array literals, ABI-encoding functions, etc.\r\n- Any expression that consists only of a variable name is **permanent**.\r\n- Return values of any other expressions are **permanent**. This includes user-defined functions, built-ins that do not directly allocate memory, any other operators that might be defined on memory objects, etc.\r\n\r\n## Implementation details\r\n### Analysis\r\nAt the analysis level we need some extra AST annotations:\r\n1. `lifespan: enum {Permanent, ForcedPermanent, Temporary, Unused}` - on every memory return value of every expression.\r\n    - To simplify the initial implementation, we treat all user-defined functions as doing permanent allocations and thus forcing temporaries to become permanent. We might be able to relax that rule later with extra analysis based on control flow graph.\r\n2. `temporaryHandling: enum {Consuming, Capturing}` - on every memory argument of every expression.\r\n    - Could also be calculated on the fly from semantic rules hard-coded in the codegen.\r\n3. `consumedTemporaries: list of AST node references` - on every expression. Pointers to nodes representing any temporaries that can be deallocated after the expression is evaluated. Includes the result of the expression itself if it's unused.\r\n    - In this initial version it could also be calculated on the fly in the codegen. This annotation plays a bigger role if we add pass-through arguments - see below.\r\n\r\n### Code generation\r\nThe optimization is performed for each statement in isolation. All allocations within the body are tracked using an internal stack (kept only at compilation time). The stack tracks sizes of temporary memory allocations in the order they are performed. The size can be in one of several variants:\r\n- `constant`: for allocations of constant size known at compilation time. In this case we store the size directly.\r\n- `memory length prefix`: for dynamic memory allocations where the the size is stored in the first slot of allocated memory (this is the case for dynamic arrays). In this case we store the address of the location of memory slot that stores the length and the type of the memory object (to be able to generate an expression that evaluates to size in bytes at runtime).\r\n- `unbounded`: (optional) for temporary allocations performed by the code generator for its own purposes. These should be ephemeral and never happen outside of generated code but we could track them as a sanity check - such an allocation only ever makes sense on the top of the stack and anything else is a bug.\r\n\r\nThe optimization works as follows:\r\n- We start with an empty stack, since temporaries cannot survive between statements.\r\n- When an expression that returns a temporary is visited, a new item containing its size is pushed on the stack.\r\n- The address returned by the allocating expression can be computred by summing up items on the stack. This produces an expression that evaluates to that value at runtime.\r\n- When an expression with non-empty `consumedTemporaries` is visited, sizes of consumed temporaries are popped from the stack. As long as the analysis is performed correctly, it can be safely assumed that all of temporaries to be popped are at the top of the stack.\r\n\r\n## Limitations and possible extensions\r\n### Pass-through parameters\r\nIn the implementation described above only passing a temporary directly into a consuming argument lets us free it. A temporary will not be freed if it's parenthesized (e.g. `(new uint[](5))`), used in a tuple (e.g. `(new uint[](1), new uint[](2), new uint[](3))`), used in an array literal (e.g. `[new uint[](1), new uint[](2), new uint[](3)]`) or a struct constructor.\r\n\r\nTo deal with this case:\r\n- Introduce a new type of parameter in addition to consuming and capturing: *pass-through*.\r\n- Use pass-through for arguments of all the expressions mentioned above. I.e. expressions for which the temporary arguments can be safely deallocated at the point where all return values are deallocated.\r\n- Consider the return values of the kinds of expressions mentioned above temporary in most cases:\r\n    - An array literal or an invocation of a struct constructor returns a temporary (this is not transitive - the array/struct can store references to permanent objects and these won't be freed with it unless they are separately tracked as temporaries).\r\n    - Parenthesized value is temporary IFF the value inside is temporary.\r\n    - A tuple literal is considered temporary for the purposes of the analysis rule below (but obviously can't be freed since it's not a memory object itself). Just like arrays/structs the temporary designation is not transitive.\r\n- In analysis:\r\n    - When a temporary T is passed into a pass-through argument of expression X:\r\n        - If any result of expression X is permanent or captured by some expression Y down the line, T becomes forced permanent.\r\n        - If all results of expression X are temporary and consumed by expression Y, add T to `consumedTemporaries` annotation on the expression Y.\r\n        - Both cases can propagate if all arguments of expression Y are also pass-through. The expression Z that eventually either captures T forcing it to become permanent or adds it to its `consumedTemporaries` can be several levels away.\r\n\r\n### Conditional allocation\r\nThe current syntax allows allocating memory in expressions that short-circuit, which results in conditional allocation. For example:\r\n- `condition ? new[](1) : new[](2)`\r\n- `new uint[](2)[0] == new uint[](2)[0] && new uint[](2)[1] == new uint[](2)[1]`\r\n- `require(condition, new uint[](2)[0] <= new uint[](2)[0] ? \"a\" : \"b\")`\r\n\r\nTo be able to mark their arguments as pass-through or consuming, we need to replace the stack in the codegen with a binary tree where each node contains a stack. Then to calculate the address of a temporary we need to sum up not just a single stack but all stacks leading up to the tree root.\r\n\r\n### User-defined functions\r\nThe initial implementation forgoes many optimization opportunities when user-defined functions are involved:\r\n1. Parameters of user-defined functions and modifiers are always capturing.\r\n    - This could be improved with extra analysis to determine which parameters actually end up never assigned to variables (consumed) or returned directly or inside other temporaries (passed through).\r\n2. Return values are permanent. It's not possible to return a temporary.\r\n    - To handle this we would need to determine, the state of the stack of temporaries at every exit point from the function.\r\n    - If there are multiple exits we would also need support for conditional allocation described above.\r\n3. We treat all user-defined functions as doing permanent allocations, thus invalidating any temporaries created before calls to such functions.\r\n    - We could use control flow graph to determine which functions are *memory-neutral*, i.e. do not actually move the free memory pointer.\r\n    - Memory-neutral functions could still perform temporary allocations. To handle this the codegen, before a call to such a function, would push a new, virtual memory pointer to EVM stack (set to the current free memory pointer plus the size of all temporaries on its internal stack). The function would use it instead of the actual free memory pointer to avoid overwriting any temporaries still present outside of the call.\r\n\r\n## Backwards Compatibility\r\nThe change is transparent to the users and can only be observed through different gas usage or inline assembly. As such it's considered fully backwards-compatible.",
  "closed_by": null,
  "reactions": {
    "url": "https://api.github.com/repos/ethereum/solidity/issues/12351/reactions",
    "total_count": 1,
    "+1": 1,
    "-1": 0,
    "laugh": 0,
    "hooray": 0,
    "confused": 0,
    "heart": 0,
    "rocket": 0,
    "eyes": 0
  },
  "timeline_url": "https://api.github.com/repos/ethereum/solidity/issues/12351/timeline",
  "performed_via_github_app": null,
  "state_reason": null
}
[
  {
    "url": "https://api.github.com/repos/ethereum/solidity/issues/comments/983556504",
    "html_url": "https://github.com/ethereum/solidity/issues/12351#issuecomment-983556504",
    "issue_url": "https://api.github.com/repos/ethereum/solidity/issues/12351",
    "id": 983556504,
    "node_id": "IC_kwDOAm_5kc46n-GY",
    "user": {
      "login": "chriseth",
      "id": 9073706,
      "node_id": "MDQ6VXNlcjkwNzM3MDY=",
      "avatar_url": "https://avatars.githubusercontent.com/u/9073706?v=4",
      "gravatar_id": "",
      "url": "https://api.github.com/users/chriseth",
      "html_url": "https://github.com/chriseth",
      "followers_url": "https://api.github.com/users/chriseth/followers",
      "following_url": "https://api.github.com/users/chriseth/following{/other_user}",
      "gists_url": "https://api.github.com/users/chriseth/gists{/gist_id}",
      "starred_url": "https://api.github.com/users/chriseth/starred{/owner}{/repo}",
      "subscriptions_url": "https://api.github.com/users/chriseth/subscriptions",
      "organizations_url": "https://api.github.com/users/chriseth/orgs",
      "repos_url": "https://api.github.com/users/chriseth/repos",
      "events_url": "https://api.github.com/users/chriseth/events{/privacy}",
      "received_events_url": "https://api.github.com/users/chriseth/received_events",
      "type": "User",
      "site_admin": false
    },
    "created_at": "2021-12-01T11:39:43Z",
    "updated_at": "2021-12-01T11:39:43Z",
    "author_association": "MEMBER",
    "body": "Another maybe simpler way is to do this at the level of functions: If all allocations inside a function turn out to be unused at the end  of the function, we can store the free memory pointer on the stack at the beginning of the function and restore it at the end. This should also be stack-pressure-neutral.",
    "reactions": {
      "url": "https://api.github.com/repos/ethereum/solidity/issues/comments/983556504/reactions",
      "total_count": 0,
      "+1": 0,
      "-1": 0,
      "laugh": 0,
      "hooray": 0,
      "confused": 0,
      "heart": 0,
      "rocket": 0,
      "eyes": 0
    },
    "performed_via_github_app": null
  },
  {
    "url": "https://api.github.com/repos/ethereum/solidity/issues/comments/985032454",
    "html_url": "https://github.com/ethereum/solidity/issues/12351#issuecomment-985032454",
    "issue_url": "https://api.github.com/repos/ethereum/solidity/issues/12351",
    "id": 985032454,
    "node_id": "IC_kwDOAm_5kc46tmcG",
    "user": {
      "login": "cameel",
      "id": 137030,
      "node_id": "MDQ6VXNlcjEzNzAzMA==",
      "avatar_url": "https://avatars.githubusercontent.com/u/137030?v=4",
      "gravatar_id": "",
      "url": "https://api.github.com/users/cameel",
      "html_url": "https://github.com/cameel",
      "followers_url": "https://api.github.com/users/cameel/followers",
      "following_url": "https://api.github.com/users/cameel/following{/other_user}",
      "gists_url": "https://api.github.com/users/cameel/gists{/gist_id}",
      "starred_url": "https://api.github.com/users/cameel/starred{/owner}{/repo}",
      "subscriptions_url": "https://api.github.com/users/cameel/subscriptions",
      "organizations_url": "https://api.github.com/users/cameel/orgs",
      "repos_url": "https://api.github.com/users/cameel/repos",
      "events_url": "https://api.github.com/users/cameel/events{/privacy}",
      "received_events_url": "https://api.github.com/users/cameel/received_events",
      "type": "User",
      "site_admin": false
    },
    "created_at": "2021-12-02T21:55:33Z",
    "updated_at": "2021-12-02T21:55:33Z",
    "author_association": "MEMBER",
    "body": "I have updated the description. I thought I'd just update it for the case of allocation with length known only at runtime but then spent most of the day today trying to think my way out of various corner cases. For example turns out that consuming temporaries in anything that short-circuits (ternary op, bool ops, `require()`) is a real pain. I figured out ways around most of it but it complicates the mechanism and I suspect you won't like that so I have put it in a separate section about possible extensions instead. This way we have an option to ignore them and go for the basics. The basic version without any extensions is still enough to handle the most interesting cases like `keccak256(abi.encode(...))`, objects never assigned to a variable, assignments that copy memory to storage, etc. Has a ton of limitations regarding user-defined functions though.\r\n\r\nThe update to the base part mostly just removed the limitation for dynamic allocations and fleshed out the rules for marking stuff consuming/non-consuming/temporary/permanent. The rest are the optional extensions.\r\n\r\n> Another maybe simpler way is to do this at the level of functions: If all allocations inside a function turn out to be unused at the end of the function, we can store the free memory pointer on the stack at the beginning of the function and restore it at the end. This should also be stack-pressure-neutral.\r\n\r\nThe biggest problem with it is that a function may have conditions and multiple exits, and conditional allocation complicates the codegen part so I think just storing the free memory pointer won't be enough. I think we'd need a tree of stacks to handle it.",
    "reactions": {
      "url": "https://api.github.com/repos/ethereum/solidity/issues/comments/985032454/reactions",
      "total_count": 0,
      "+1": 0,
      "-1": 0,
      "laugh": 0,
      "hooray": 0,
      "confused": 0,
      "heart": 0,
      "rocket": 0,
      "eyes": 0
    },
    "performed_via_github_app": null
  }
]
